app/controllers/experiences_controller.rb

  def index
    @experience = Experience.all
---
SELECT "experiences".* FROM "experiences"

  def show
    @experience = Experience.find(params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]