app/controllers/guests_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    @guests = Trip.all

SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @guest = Guest.find(params[:id])