app/controllers/itineraries_controller.rb

  def index
    @itineraries = Itinerary.all
---
SELECT "itineraries".* FROM "itineraries"

  def show
    @itinerary = Itinerary.find(params[:id])
---
SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]