app/controllers/trip_templates_controller.rb

SELECT "trip_templates".* FROM "trip_templates"
---
  def index
    @trip_templates = TripTemplate.all

SELECT  "trip_templates".* FROM "trip_templates" WHERE "trip_templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @trip_template = TripTemplate.find(params[:id])