app/controllers/trips_controller.rb

  def show
    @trip = Experience.find(params[:id])
---
SELECT  "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]